--- a/docs/10-java/src/rt.jar.src/java/util/concurrent/executor.ThreadPoolExecutor.md
+++ b/docs/10-java/src/rt.jar.src/java/util/concurrent/executor.ThreadPoolExecutor.md
@@ -139,7 +139,139 @@ RejectedExecutionHandler <|-- DiscardOldestPolicy
+```
+
+#### mermaid
+```mermaid
+graph LR
+    RUNNING -- shutdown --> SHUTDOWN
+    RUNNING -- shutdownNow --> STOP
+    SHUTDOWN -- shutdownNow --> STOP
+    SHUTDOWN -- queueAndPoolEmpty --> TIDYING
+    STOP -- poolEmpty --> TIDYING
+    TIDYING -- terminated --> TERMINATED
+``` 
+
+### workQueue
+```java
@@ -174,49 +306,103 @@ sequenceDiagram
+    
 ```
 
-```plantuml
-@startuml
-[*] -right-> RUNNING
-RUNNING -right-> SHUTDOWN: shutdown()
+## inner class
 
-RUNNING --> STOP: shutdownNow()
-SHUTDOWN -right-> STOP: shutdownNow()
@@
 
-SHUTDOWN -right-> TIDYING: queue, pool empty
-STOP --> TIDYING: pool empty
-
-TIDYING --> TERMINATED: terminated()
-TERMINATED -right-> [*]
-
-@enduml
@@
 ```
